{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape_type": "raw", "output_shape": null, "name": "lambda_2", "input_dtype": "float32", "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-30-3fcc7f0ccb59>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_2", "cropping": [[50, 25], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_filter": 24, "name": "convolution2d_6", "trainable": true, "nb_row": 5, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_filter": 36, "name": "convolution2d_7", "trainable": true, "nb_row": 5, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_filter": 48, "name": "convolution2d_8", "trainable": true, "nb_row": 5, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "nb_col": 5, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "name": "batchnormalization_7", "epsilon": 0.001, "trainable": true, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_9", "trainable": true, "nb_row": 3, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "name": "batchnormalization_8", "epsilon": 0.001, "trainable": true, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_10", "trainable": true, "nb_row": 3, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "name": "dense_5", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "input_dim": 48576, "b_regularizer": null, "output_dim": 100, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "name": "dense_6", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "input_dim": 100, "b_regularizer": null, "output_dim": 50, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "name": "dense_7", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "input_dim": 50, "b_regularizer": null, "output_dim": 10, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "name": "dense_8", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "input_dim": 10, "b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "b_constraint": null}}], "keras_version": "1.2.1"}